
## :white_check_mark: Apply Succeeded (koyashiro.net)

[CI link](https://github.com/koyashiro/infra/actions/runs/8799978837)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.txt_dmarc: Refreshing state... [id=ed72b5a4988759c6fba528f30aaf8774]
cloudflare_record.mx_alt3: Refreshing state... [id=b992ff41459ab3f5b0e8dcc2bc694827]
cloudflare_record.txt_discord: Refreshing state... [id=6c2a03277c1c0316279abe5f302c5745]
cloudflare_record.mx_alt4: Refreshing state... [id=219a76a69f8880eeae68cc527fdf64a0]
cloudflare_record.mx_primary: Refreshing state... [id=1ddf6f336013779c232ec6a394367d77]
cloudflare_record.txt_spf: Refreshing state... [id=de681523c30bfdbf10f37cbe9cdff23a]
cloudflare_record.cname_root: Refreshing state... [id=d58e18342013a85711948497d1a02b1a]
cloudflare_record.txt_google_dkim: Refreshing state... [id=5d46eade5a06f5f800b978d4d3f6bbd0]
cloudflare_record.cname_vpm: Refreshing state... [id=2ecd27a583d3aa5d7c8ee4db71d77bc1]
cloudflare_record.txt_google_suite_verification: Refreshing state... [id=51aed5edfda688a4954fa9512bd6b0c7]
cloudflare_record.mx_alt1: Refreshing state... [id=b42c903d6fe8ebe5dce8544e7cd1f86c]
cloudflare_record.txt_keybase_site_verification: Refreshing state... [id=08a9aea85efa8460b0e4ffcf4e9c1a0f]
cloudflare_record.mx_alt2: Refreshing state... [id=b739db8088696aca278313b2ee3e21c8]
cloudflare_record.txt_dkim: Refreshing state... [id=f8676c4176fbdd3876b32c39e63d997c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_cdn will be created
  + resource "cloudflare_record" "cname_cdn" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cdn"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "cdn-koyashiro.pages.dev"
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
cloudflare_record.cname_cdn: Creating...
cloudflare_record.cname_cdn: Creation complete after 0s [id=7f50c261a33dc44e71e969c856b9d168]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":177,"Program":"tfcmt","SHA1":"70894473ca8a81b66744bca41b033c4cb009e067","Target":"koyashiro.net","Vars":{},"WorkflowName":"terraform"} -->